source/.NET Standard/Unimake.Business.DFe/Servicos/Config/NFSe/SinopMT.xml

<?xml version="1.0" encoding="utf-8"?>
<Configuracoes>
  <Servicos ID="NFSe">
    <RecepcionarLoteRps versao="2.02">
      <Descricao>Recepcionar Lote RPS</Descricao>
      <WebEnderecoHomologacao>https://www.gp.srv.br/tributario_homologacao/servlet/anfse_web_service</WebEnderecoHomologacao>
      <WebEnderecoProducao>https://www.gp.srv.br/tributario_sinop/servlet/anfse_web_service</WebEnderecoProducao>
      <WebActionHomologacao>Tributarioaction/ANFSE_WEB_SERVICE.RECEPCIONARLOTERPS</WebActionHomologacao>
      <WebActionProducao>Tributarioaction/ANFSE_WEB_SERVICE.RECEPCIONARLOTERPS</WebActionProducao>
      <SchemaArquivo>nfse_v2_02.xsd</SchemaArquivo>
      <TagAssinatura>Rps</TagAssinatura>
      <TagAtributoID>InfDeclaracaoPrestacaoServico</TagAtributoID>
      <TagLoteAssinatura>EnviarLoteRpsEnvio</TagLoteAssinatura>
      <TagLoteAtributoID>LoteRps</TagLoteAtributoID>
      <WebContentType>text/xml;charset=UTF-8</WebContentType>
	  <WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><nfse_web_service.RECEPCIONARLOTERPS xmlns="Tributario"><Recepcionarloterpsrequest><nfseCabecMsg><![CDATA[<cabecalho xmlns="http://www.abrasf.org.br/nfse.xsd" versao="2.01"><versaoDados>2.01</versaoDados></cabecalho>]]]]><![CDATA[></nfseCabecMsg><nfseDadosMsg><![CDATA[{xmlBody}]]]]><![CDATA[></nfseDadosMsg></Recepcionarloterpsrequest></nfse_web_service.RECEPCIONARLOTERPS></soap:Body></soap:Envelope>]]]]></WebSoapString>
      <WebTagRetorno>prop:innertext</WebTagRetorno>
      <WebEncodingRetorno>UTF-8</WebEncodingRetorno>
      <WebSoapVersion>soap11</WebSoapVersion>
      <SchemaVersao>2.02</SchemaVersao>
      <TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
    </RecepcionarLoteRps>
    <RecepcionarLoteRpsSincrono versao="2.02">
      <Descricao>Recepcionar Lote RPS Sincrono</Descricao>
      <WebEnderecoHomologacao>https://www.gp.srv.br/tributario_homologacao/servlet/anfse_web_service</WebEnderecoHomologacao>
      <WebEnderecoProducao>https://www.gp.srv.br/tributario_sinop/servlet/anfse_web_service</WebEnderecoProducao>
      <WebActionHomologacao>Tributarioaction/ANFSE_WEB_SERVICE.RECEPCIONARLOTERPSSINCRONO</WebActionHomologacao>
      <WebActionProducao>Tributarioaction/ANFSE_WEB_SERVICE.RECEPCIONARLOTERPSSINCRONO</WebActionProducao>
      <SchemaArquivo>nfse_v2_02.xsd</SchemaArquivo>
      <TagAssinatura>Rps</TagAssinatura>
      <TagAtributoID>InfDeclaracaoPrestacaoServico</TagAtributoID>
      <TagLoteAssinatura>EnviarLoteRpsEnvio</TagLoteAssinatura>
      <TagLoteAtributoID>LoteRps</TagLoteAtributoID>
      <WebContentType>text/xml;charset=UTF-8</WebContentType>
	  <WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><nfse_web_service.RECEPCIONARLOTERPSSINCRONO xmlns="Tributario"><Recepcionarloterpssincronorequest><nfseCabecMsg><![CDATA[<cabecalho xmlns="http://www.abrasf.org.br/nfse.xsd" versao="2.01"><versaoDados>2.01</versaoDados></cabecalho>]]]]><![CDATA[></nfseCabecMsg><nfseDadosMsg><![CDATA[{xmlBody}]]]]><![CDATA[></nfseDadosMsg></Recepcionarloterpssincronorequest></nfse_web_service.RECEPCIONARLOTERPSSINCRONO></soap:Body></soap:Envelope>]]]]></WebSoapString>
      <WebTagRetorno>prop:innertext</WebTagRetorno>
      <WebEncodingRetorno>UTF-8</WebEncodingRetorno>
      <WebSoapVersion>soap11</WebSoapVersion>
      <SchemaVersao>2.02</SchemaVersao>
      <TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
    </RecepcionarLoteRpsSincrono>
    <CancelarNfse versao="2.02">
      <Descricao>Cancelar nota fiscal de serviço</Descricao>
      <WebEnderecoHomologacao>https://www.gp.srv.br/tributario_homologacao/servlet/anfse_web_service</WebEnderecoHomologacao>
      <WebEnderecoProducao>https://www.gp.srv.br/tributario_sinop/servlet/anfse_web_service</WebEnderecoProducao>
      <WebActionHomologacao>Tributarioaction/ANFSE_WEB_SERVICE.CANCELARNFSE</WebActionHomologacao>
      <WebActionProducao>Tributarioaction/ANFSE_WEB_SERVICE.CANCELARNFSE</WebActionProducao>
      <SchemaArquivo>nfse_v2_02.xsd</SchemaArquivo>
      <TagAssinatura>Pedido</TagAssinatura>
      <TagAtributoID>InfPedidoCancelamento</TagAtributoID>
      <TagLoteAssinatura></TagLoteAssinatura>
      <TagLoteAtributoID></TagLoteAtributoID>
      <WebContentType>text/xml;charset=UTF-8</WebContentType>
	  <WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><nfse_web_service.CANCELARNFSE xmlns="Tributario"><Cancelarnfserequest><nfseCabecMsg><![CDATA[<cabecalho xmlns="http://www.abrasf.org.br/nfse.xsd" versao="2.01"><versaoDados>2.01</versaoDados></cabecalho>]]]]><![CDATA[></nfseCabecMsg><nfseDadosMsg><![CDATA[{xmlBody}]]]]><![CDATA[></nfseDadosMsg></Cancelarnfserequest></nfse_web_service.CANCELARNFSE></soap:Body></soap:Envelope>]]]]></WebSoapString>
      <WebTagRetorno>prop:innertext</WebTagRetorno>
      <WebEncodingRetorno>UTF-8</WebEncodingRetorno>
      <WebSoapVersion>soap11</WebSoapVersion>
      <SchemaVersao>2.02</SchemaVersao>
      <TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
    </CancelarNfse>
    <SubstituirNfse versao="2.02">
      <Descricao>Substituir nota fiscal de Serviço</Descricao>
      <WebEnderecoHomologacao>https://www.gp.srv.br/tributario_homologacao/servlet/anfse_web_service</WebEnderecoHomologacao>
      <WebEnderecoProducao>https://www.gp.srv.br/tributario_sinop/servlet/anfse_web_service</WebEnderecoProducao>
      <WebActionHomologacao>Tributarioaction/ANFSE_WEB_SERVICE.SUBSTITUIRNFSE</WebActionHomologacao>
      <WebActionProducao>Tributarioaction/ANFSE_WEB_SERVICE.SUBSTITUIRNFSE</WebActionProducao>
      <SchemaArquivo>nfse_v2_02.xsd</SchemaArquivo>
      <TagAssinatura>Pedido</TagAssinatura>
      <TagAtributoID>InfPedidoCancelamento</TagAtributoID>
      <TagLoteAssinatura>Rps</TagLoteAssinatura>
      <TagLoteAtributoID>InfDeclaracaoPrestacaoServico</TagLoteAtributoID>
      <TagExtraAssinatura>SubstituirNfseEnvio</TagExtraAssinatura>
      <TagExtraAtributoID>SubstituicaoNfse</TagExtraAtributoID>
      <WebContentType>text/xml;charset=UTF-8</WebContentType>
	  <WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><nfse_web_service.SUBSTITUIRNFSE xmlns="Tributario"><Substituirnfserequest><nfseCabecMsg><![CDATA[<cabecalho xmlns="http://www.abrasf.org.br/nfse.xsd" versao="2.01"><versaoDados>2.01</versaoDados></cabecalho>]]]]><![CDATA[></nfseCabecMsg><nfseDadosMsg><![CDATA[{xmlBody}]]]]><![CDATA[></nfseDadosMsg></Substituirnfserequest></nfse_web_service.SUBSTITUIRNFSE></soap:Body></soap:Envelope>]]]]></WebSoapString>
      <WebTagRetorno>prop:innertext</WebTagRetorno>
      <WebEncodingRetorno>UTF-8</WebEncodingRetorno>
      <WebSoapVersion>soap11</WebSoapVersion>
      <SchemaVersao>2.02</SchemaVersao>
      <TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
    </SubstituirNfse>
    <ConsultarLoteRps versao="2.02">
      <Descricao>Consulta lote RPS</Descricao>
      <WebEnderecoHomologacao>https://www.gp.srv.br/tributario_homologacao/servlet/anfse_web_service</WebEnderecoHomologacao>
      <WebEnderecoProducao>https://www.gp.srv.br/tributario_sinop/servlet/anfse_web_service</WebEnderecoProducao>
      <WebActionHomologacao></WebActionHomologacao>
      <WebActionProducao></WebActionProducao>
      <SchemaArquivo>nfse_v2_02.xsd</SchemaArquivo>
      <TagAssinatura></TagAssinatura>
      <TagAtributoID></TagAtributoID>
      <TagLoteAssinatura></TagLoteAssinatura>
      <TagLoteAtributoID></TagLoteAtributoID>
      <WebContentType>text/xml;charset=UTF-8</WebContentType>
	  <WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><nfse_web_service.CONSULTARLOTERPS xmlns="Tributario"><Consultarloterpsrequest><nfseCabecMsg><![CDATA[<cabecalho xmlns="http://www.abrasf.org.br/nfse.xsd" versao="2.01"><versaoDados>2.01</versaoDados></cabecalho>]]]]><![CDATA[></nfseCabecMsg><nfseDadosMsg><![CDATA[{xmlBody}]]]]><![CDATA[></nfseDadosMsg></Consultarloterpsrequest></nfse_web_service.CONSULTARLOTERPS></soap:Body></soap:Envelope>]]]]></WebSoapString>
	  <WebTagRetorno>prop:innertext</WebTagRetorno>
      <WebEncodingRetorno>UTF-8</WebEncodingRetorno>
      <WebSoapVersion>soap11</WebSoapVersion>
      <SchemaVersao>2.02</SchemaVersao>
      <TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
    </ConsultarLoteRps>
    <ConsultarNfsePorRps versao="2.02">
      <Descricao>Consulta NFSe por RPS</Descricao>
      <WebEnderecoHomologacao>https://www.gp.srv.br/tributario_homologacao/servlet/anfse_web_service</WebEnderecoHomologacao>
      <WebEnderecoProducao>https://www.gp.srv.br/tributario_sinop/servlet/anfse_web_service</WebEnderecoProducao>
      <WebActionHomologacao></WebActionHomologacao>
      <WebActionProducao></WebActionProducao>
      <SchemaArquivo>nfse_v2_02.xsd</SchemaArquivo>
      <TagAssinatura></TagAssinatura>
      <TagAtributoID></TagAtributoID>
      <TagLoteAssinatura></TagLoteAssinatura>
      <TagLoteAtributoID></TagLoteAtributoID>
      <WebContentType>text/xml;charset=UTF-8</WebContentType>
	  <WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><nfse_web_service.CONSULTARNFSEPORRPS xmlns="Tributario"><Consultarnfseporrpsrequest><nfseCabecMsg><![CDATA[<cabecalho xmlns="http://www.abrasf.org.br/nfse.xsd" versao="2.01"><versaoDados>2.01</versaoDados></cabecalho>]]]]><![CDATA[></nfseCabecMsg><nfseDadosMsg><![CDATA[{xmlBody}]]]]><![CDATA[></nfseDadosMsg></Consultarnfseporrpsrequest></nfse_web_service.CONSULTARNFSEPORRPS></soap:Body></soap:Envelope>]]]]></WebSoapString>
      <WebTagRetorno>prop:innertext</WebTagRetorno>
      <WebEncodingRetorno>UTF-8</WebEncodingRetorno>
      <WebSoapVersion>soap11</WebSoapVersion>
      <SchemaVersao>2.02</SchemaVersao>
      <TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
    </ConsultarNfsePorRps>
    <ConsultarNfseFaixa versao="2.02">
      <Descricao></Descricao>
      <WebEnderecoHomologacao>https://www.gp.srv.br/tributario_homologacao/servlet/anfse_web_service</WebEnderecoHomologacao>
      <WebEnderecoProducao>https://www.gp.srv.br/tributario_sinop/servlet/anfse_web_service</WebEnderecoProducao>
      <WebActionHomologacao></WebActionHomologacao>
      <WebActionProducao></WebActionProducao>
      <SchemaArquivo>nfse_v2_02.xsd</SchemaArquivo>
      <TagAssinatura></TagAssinatura>
      <TagAtributoID></TagAtributoID>
      <TagLoteAssinatura></TagLoteAssinatura>
      <TagLoteAtributoID></TagLoteAtributoID>
      <WebContentType>text/xml;charset=UTF-8</WebContentType>
	  <WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><nfse_web_service.CONSULTARNFSEFAIXA xmlns="Tributario"><Consultarnfseporfaixarequest><nfseCabecMsg><![CDATA[<cabecalho xmlns="http://www.abrasf.org.br/nfse.xsd" versao="2.01"><versaoDados>2.01</versaoDados></cabecalho>]]]]><![CDATA[></nfseCabecMsg><nfseDadosMsg><![CDATA[{xmlBody}]]]]><![CDATA[></nfseDadosMsg></Consultarnfseporfaixarequest></nfse_web_service.CONSULTARNFSEFAIXA></soap:Body></soap:Envelope>]]]]></WebSoapString>
      <WebTagRetorno>prop:innertext</WebTagRetorno>
      <WebEncodingRetorno>UTF-8</WebEncodingRetorno>
      <WebSoapVersion>soap11</WebSoapVersion>
      <SchemaVersao>2.02</SchemaVersao>
      <TargetNS>http://www.abrasf.org.br/nfse.xsd</TargetNS>
    </ConsultarNfseFaixa>
  </Servicos>
</Configuracoes>